a = int(input("Введите день: "))
b = int(input("Введите месяц: "))
if b == 12 || b ==1 || b == 2:
if b == 12:
    if 31 >= a >= 1:
    print (a, "декабря - Зима")
    else:
        print("В декабре от 1 до 31 дня ")
if b == 1:
    if 31 >= a >= 1:
    print (a, "января - Зима")
    else:
        print("В январе от 1 до 31 дня ")
if b == 2:
    if 28 >= a >= 1:
    print (a, "февраля - Зима")
    else:
        print("В феврале от 1 до 31 дня ")
if b == 12:
    if 31 >= a >= 1:
    print (a, "декабря - Зима")
    else:
        print("В декабре от 1 до 31 дня ")
if b == 1:
    if 31 >= a >= 1:
    print (a, "января - Зима")
    else:
        print("В январе от 1 до 31 дня ")
if b == 2:
    if 28 >= a >= 1:
    print (a, "февраля - Зима")
    else:
        print("В феврале от 1 до 31 дня ")
